In [1]:
# ! pip install psycopg2

In [164]:
data_path = '/home/jovyan/work/Wirecard/db/postgres/src/raw/'

In [110]:
import pandas as pd
# import psycopg2

### Ler e analisar o arquivo "acquirer_responses.csv"

In [111]:
acquirer_responses = pd.read_csv('acquirer_responses.csv', sep=';')

In [112]:
acquirer_responses.head(5)

,acquirer_responses_id,payment_id,acquirer_id,brand_id,acquirer_transaction_id,returned_code_id,transaction_datetime,amount
0,16049274,102251414,3,1,5579493,1,01/01/18 11:13,214.76
1,16051543,102256593,3,2,5580699,1,01/01/18 14:32,41.65
2,16051543,102256593,3,2,5580700,12,01/01/18 14:32,41.65
3,16055961,102266298,3,1,5583065,1,01/01/18 19:34,27.74
4,16056575,102267764,1,2,10150253,2,01/01/18 20:15,71.97

In [113]:
acquirer_responses.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6675 entries, 0 to 6674
Data columns (total 8 columns):
acquirer_responses_id      6675 non-null int64
payment_id                 6675 non-null int64
acquirer_id                6675 non-null int64
brand_id                   6675 non-null int64
acquirer_transaction_id    6675 non-null int64
returned_code_id           6675 non-null int64
transaction_datetime       6653 non-null object
amount                     6265 non-null object
dtypes: int64(6), object(2)
memory usage: 417.3+ KB

In [114]:
acquirer_responses.shape

(6675, 8)

### Tirar registros duplicados

In [115]:
acquirer_responses['acquirer_responses_id'].drop_duplicates(inplace=True)

In [116]:
acquirer_responses.shape

(6675, 8)

In [117]:
acquirer_responses.isnull().sum()

acquirer_responses_id        0
payment_id                   0
acquirer_id                  0
brand_id                     0
acquirer_transaction_id      0
returned_code_id             0
transaction_datetime        22
amount                     410
dtype: int64

In [118]:
acquirer_responses.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6675 entries, 0 to 6674
Data columns (total 8 columns):
acquirer_responses_id      6675 non-null int64
payment_id                 6675 non-null int64
acquirer_id                6675 non-null int64
brand_id                   6675 non-null int64
acquirer_transaction_id    6675 non-null int64
returned_code_id           6675 non-null int64
transaction_datetime       6653 non-null object
amount                     6265 non-null object
dtypes: int64(6), object(2)
memory usage: 415.8+ KB

### Transformar coluna "amount" em float

In [119]:
acquirer_responses[acquirer_responses['amount'] == '26.416.000.000.000.000']

,acquirer_responses_id,payment_id,acquirer_id,brand_id,acquirer_transaction_id,returned_code_id,transaction_datetime,amount
4508,29877499,129455174,4,1,1334613,12,25/09/18 15:34,26.416.000.000.000.000

In [120]:
def transform_column(column):
    column = column.str.slice(stop=6)
    return column

In [121]:
acquirer_responses['amount'] = transform_column(acquirer_responses['amount'])
acquirer_responses['amount']

0       214.76
1        41.65
2        41.65
3        27.74
4        71.97
         ...
6670        17
6671        17
6672       275
6673       NaN
6674        47
Name: amount, Length: 6675, dtype: object

### Tratar coluna "amount" nulas

In [122]:
acquirer_responses[acquirer_responses['amount'].isnull()]

,acquirer_responses_id,payment_id,acquirer_id,brand_id,acquirer_transaction_id,returned_code_id,transaction_datetime,amount
23,16114296,102399620,2,2,445487,9,03/01/18 13:09,NaN
104,16339313,102902088,2,4,450637,1,09/01/18 10:31,NaN
105,16339313,102902088,2,4,450637,12,09/01/18 10:31,NaN
118,16364301,102955528,2,4,451272,1,09/01/18 17:57,NaN
156,16487386,103231479,2,1,454204,10,12/01/18 10:01,NaN
...,...,...,...,...,...,...,...,...
6659,36658359,141348539,2,2,1900991,2,30/12/18 19:40,NaN
6660,36659977,141350890,2,2,1901261,2,30/12/18 20:40,NaN
6664,36666170,141359149,2,1,1902344,2,31/12/18 00:01,NaN
6669,36685368,141386630,2,1,1905618,9,31/12/18 13:56,NaN
6673,36687196,141388928,2,1,1905896,10,31/12/18 14:40,NaN

In [123]:
acquirer_responses['amount'].isnull().sum()

410

In [124]:
acquirer_responses['amount'] = acquirer_responses['amount'].fillna(0)

In [125]:
acquirer_responses['amount'].isnull().sum()

0

### Transformando a coluna em float

In [126]:
acquirer_responses.amount = acquirer_responses.amount.astype(float)

In [127]:
acquirer_responses.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6675 entries, 0 to 6674
Data columns (total 8 columns):
acquirer_responses_id      6675 non-null int64
payment_id                 6675 non-null int64
acquirer_id                6675 non-null int64
brand_id                   6675 non-null int64
acquirer_transaction_id    6675 non-null int64
returned_code_id           6675 non-null int64
transaction_datetime       6653 non-null object
amount                     6675 non-null float64
dtypes: float64(1), int64(6), object(1)
memory usage: 417.3+ KB

In [65]:
# psql_dele_dias_semana = 'TRUNCATE TABLE wirecard.acquirer_responses;'
# con.commit()
# cur.execute(psql_dele_dias_semana)

# psql="COPY  wirecard.acquirer_responses from 'acquirer_responses.csv' with delimiter ';' csv header encoding 'windows-1251';"


# con.commit()
# cur.execute(psql)